//  Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. 
//  Данные вводятся с консоли пользователем

Console.Write("Введите ряд чисел: ");


int[] array = new int[8];
Console.Write("[");

for(int i = 0; i < numbers.Length; i++)
{
    

}
Console.Write("]");
